InformationRegisters/ЛБ_ГрафикРаботыЛомбардаПостоянный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ГрафикРаботыЛомбардаПостоянный</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерерывНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерерывОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочиеМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выходной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ДниНедели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДня</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ЛБ_РедактированиеДанныхУчетаВремениЗаДень/Ext/Form/Module.bsl
&НаКлиенте
Процедура Ок(Команда)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ВидВремени",   	ВидВремени);
	СтруктураВозврата.Вставить("Часов", 		Часов);  
	СтруктураВозврата.Вставить("Территория", 	Территория); 
	СтруктураВозврата.Вставить("НомерДня", 		НомерДня);
	СтруктураВозврата.Вставить("пересчитыватьИтог", 		Истина);



	ЭтаФорма.Закрыть(СтруктураВозврата);

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидВремени 		= Параметры.ВидВремени; 
	Часов 			= Параметры.Часов;
	НомерДня 		= Параметры.НомерДня;  
	Территория 		= Параметры.Территория; 
	Сотрудник 		= Параметры.Сотрудник; 
	ДатаРаботы     	= Параметры.ДатаРаботы;
	Ломбард     	= Параметры.Ломбард;
	
	Если НЕ ЗначениеЗаполнено(ВидВремени) Тогда
		ВидВремени = Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Явка;
	КонецЕсли;
	
	Если Параметры.ПолучитьЧасыИзГрафика Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ГрафикРаботыЛомбардаПостоянныйСрезПоследних.РабочиеМинуты КАК РабочиеМинуты
		               |ИЗ
		               |	РегистрСведений.ЛБ_ГрафикРаботыЛомбардаПостоянный.СрезПоследних КАК ЛБ_ГрафикРаботыЛомбардаПостоянныйСрезПоследних
		               |ГДЕ
		               |	ЛБ_ГрафикРаботыЛомбардаПостоянныйСрезПоследних.Ломбард = &Ломбард
		               |	И ЛБ_ГрафикРаботыЛомбардаПостоянныйСрезПоследних.НомерДня = &НомерДня";
		Запрос.УстановитьПараметр("Ломбард", Ломбард);
		Запрос.УстановитьПараметр("НомерДня", ДеньНедели(ДатаРаботы));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Часов = Выборка.РабочиеМинуты/60;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидВремениПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
	
	
Процедура УстановитьВидимость()
	Если ЗначениеЗаполнено(ВидВремени) Тогда		
		Если ВидВремени.Целосменное Тогда
			Часов = 0;
			Элементы.Часов.Доступность = Ложь;
			Элементы.Территория.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры
